# Data cleaning using Pandas and real Estate life

In [1]:
import pandas as pd

In [3]:
sheet = pd.read_csv("data/Bengaluru_House_Data.csv")
sheet.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.0
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.0
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.0

In [4]:
#Step1 ---check the shape
sheet.shape

(13320, 9)

In [11]:
#group by columns with respect to a specific column
sheet.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [7]:
# step--02--->remove extra columns which is not needed
sheet2 = sheet.drop(['availability','location','society','balcony'],axis='columns')
sheet2.head()

              area_type       size total_sqft  bath   price
0  Super built-up  Area      2 BHK       1056   2.0   39.07
1            Plot  Area  4 Bedroom       2600   5.0  120.00
2        Built-up  Area      3 BHK       1440   2.0   62.00
3  Super built-up  Area      3 BHK       1521   3.0   95.00
4  Super built-up  Area      2 BHK       1200   2.0   51.00

In [77]:
#Now we can drop null rows are fill null rows
sheet2.isna().sum()

area_type      0
size          16
total_sqft     0
bath           0
price          0
dtype: int64

In [78]:
sheet2['bath'] = sheet2['bath'].fillna(sheet2['bath']).median()

In [79]:
sheet3 = sheet2.dropna()
sheet3.head()

              area_type       size total_sqft  bath   price
0  Super built-up  Area      2 BHK       1056   2.0   39.07
1            Plot  Area  4 Bedroom       2600   2.0  120.00
2        Built-up  Area      3 BHK       1440   2.0   62.00
3  Super built-up  Area      3 BHK       1521   2.0   95.00
4  Super built-up  Area      2 BHK       1200   2.0   51.00

In [80]:
sheet3.isna().sum()

area_type     0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [81]:
#Now you can split size into two part numeric part and strinf part
sheet3['BHK'] = sheet3['size'].apply(lambda x: int(x.split(' ')[0]))
sheet3.head()

#You can remove warning by this
import warnings
warnings.filterwarnings("ignore")

In [82]:
#Now come towards the total sqrf columns
# first convert this column into float datatype
def is_float(value):
    try:
        float(value)
    except:
        return False
    return True

In [83]:
sheet3[~sheet3['total_sqft'].apply(is_float)].head(10)

                area_type       size      total_sqft  bath    price  BHK
30   Super built-up  Area      4 BHK     2100 - 2850   2.0  186.000    4
56         Built-up  Area  4 Bedroom     3010 - 3410   2.0  192.000    4
81         Built-up  Area  4 Bedroom     2957 - 3450   2.0  224.500    4
122  Super built-up  Area      4 BHK     3067 - 8156   2.0  477.000    4
137  Super built-up  Area      2 BHK     1042 - 1105   2.0   54.005    2
165  Super built-up  Area      2 BHK     1145 - 1340   2.0   43.490    2
188  Super built-up  Area      2 BHK     1015 - 1540   2.0   56.800    2
224  Super built-up  Area      3 BHK     1520 - 1740   2.0   74.820    3
410  Super built-up  Area      1 BHK  34.46Sq. Meter   2.0   18.500    1
549  Super built-up  Area      2 BHK     1195 - 1440   2.0   63.770    2

In [84]:
#now we'll handle total_sqft values that have range e.g 2400-2600
def convertion(value):
    token = value.split('-')
    if len(token)==2:
        return (float(token[0])+float(token[1]))/2
    try:
        return float(value)
    except:
        return None

In [85]:
convertion('2002-2003')

2002.5

In [87]:
sheet4 = sheet3.copy()
sheet4['total_sqft'] = sheet4['total_sqft'].apply(convertion)
sheet4.tail(5)

                  area_type       size  total_sqft  bath  price  BHK
13315        Built-up  Area  5 Bedroom      3453.0   2.0  231.0    5
13316  Super built-up  Area      4 BHK      3600.0   2.0  400.0    4
13317        Built-up  Area      2 BHK      1141.0   2.0   60.0    2
13318  Super built-up  Area      4 BHK      4689.0   2.0  488.0    4
13319  Super built-up  Area      1 BHK       550.0   2.0   17.0    1